test/backend/scripts/performance/login.yml
config:
  target: '{{$process.env.URL}}'
  plugins:
    expect: {}
  phases:
    - duration: 10
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: ''
scenarios:
  - flow:
      - post:
          url: '/Users/login'
          json:
            username: '{{$process.env.EMAIL}}'
            password: '{{$process.env.PASSWORD}}'
            expect:
              - statusCode: 200